%%%%%%%%%%%%%%%%%%%%%         id3算法的训练与测试    %%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%     id3_main.m   %%%%%%%%%%%%%
%%%%%%%%%%%%%%%%    data:2020年6月14日    author:SA19006004陈国良  %%%%%%%%%%

%%%%%程序说明
%%%在UCI的DNA数据集下，对id3算法进行训练与测试
%%%经过data_test_nondecision.m分析后，训练数据集与测试数据集中均没有“相同属性，不同类别”的数据

%%%%%%实验环境
%软件版本：MATLAB R2019a

%************************* 程序主体 ************************%
clear;
clc;

%%%%%%%%%%%%%%%%%%%%%%%  参数设定   %%%%%%%%%%%%%%%%%%%%
delta= 0.1;  %信息增益门限值 

%%%%%%%%%%%%%%%%%%%%%%%  数据集训练出决策树   %%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%数据预处理
%%%data_train：训练数据集样本数*（属性数+类别数）
%%%attributes_label：cell类型，属性
[data_train,attributes_label] =  id3_preprocess(1);
[length_trainx,length_trainy] = size(data_train);
data_1 = data_train(:,1:length_trainy-1);
%%%decision:训练样本数*判决结果
decision = data_train(:,length_trainy);

%%%%%%%%%训练决策树
decisionTreeModel=decisionTree(data_1,decision,attributes_label,delta);

%%%%%%%%%%%%%%%%%%%%%%% 训练好的决策树去测试   %%%%%%%%%%%%%%%%%%%%
[data_test,~] =  id3_preprocess(2);
[length_testx,length_testy] = size(data_test);
data_2 = data_test(:,1:length_testy-1);
expect_result = data_test(:,length_testy);

%%%%%%%%%%%%%%%%%%%%%%% 测试结果   %%%%%%%%%%%%%%%%%%%%
data_result = decisionTreeTest(decisionTreeModel,data_2,attributes_label);
right_location = (expect_result == data_result);
right_number = sum (right_location);
right_rate = right_number/length_testx

aaa = 1;

%%%%%%%%%%%%%%%%测试数据集样本数为1186
%%%%%%%%%%%%%%%%delta = 0.001时，
%%%%采用信息熵增益最大挑选最佳属性时，正确分类样本数为1061，正确率是0.894603709949410
%%%%采用信息熵增益率最大时挑选最佳属性时，正确分类样本数为1068，正确率是0.900505902192243

%%%%%%%%%%%%%%%%delta = 0.01时，
%%%%采用信息熵增益最大挑选最佳属性时，正确分类样本数为1061，正确率是0.894603709949410
%%%%采用信息熵增益率最大时挑选最佳属性时，正确分类样本数为1068，正确率是0.900505902192243

%%%%%%%%%%%%%%%%delta = 0.05时，
%%%%采用信息熵增益最大挑选最佳属性时，正确分类样本数为1068，正确率是0.900505902192243
%%%%采用信息熵增益率最大时挑选最佳属性时，正确分类样本数为1080，正确率是0.910623946037100

%%%%%%%%%%%%%%%%delta = 0.1时，
%%%%采用信息熵增益最大挑选最佳属性时，正确分类样本数为1077，正确率是0.908094435075885
%%%%采用信息熵增益率最大时挑选最佳属性时，正确分类样本数为1059，正确率是0.892917369308600

%%%%%%%%%%%%%%%%delta = 0.15时，
%%%%采用信息熵增益最大挑选最佳属性时，正确分类样本数为1070，正确率是0.902192242833052
%%%%采用信息熵增益率最大时挑选最佳属性时，正确分类样本数为1000，正确率是0.843170320404722

%%%%%%%%%%%%%%%%delta = 0.2时，
%%%%采用信息熵增益最大挑选最佳属性时，正确分类样本数为1043，正确率是0.879426644182125
%%%%采用信息熵增益率最大时挑选最佳属性时，正确分类样本数为1002，正确率是0.844856661045531

delta_3 = [0.001,0.01,0.05,0.1,0.15,0.2];
rate1 = [0.894603709949410 0.894603709949410 0.900505902192243 0.908094435075885 0.902192242833052 0.879426644182125];
rate2 = [0.900505902192243 0.900505902192243 0.910623946037100 0.892917369308600 0.843170320404722 0.844856661045531];
figure(1);
plot(delta_3,rate1,'-+');
hold on;
grid on;
plot(delta_3,rate2,'-*');
xlabel('delta值');
ylabel('正确率');
title('测试数据集分类正确率随delta值变化图');
legend('采用信息熵增益最大选择最佳特征','采用信息熵增益率最大选择最佳特征');


%%%%%%%%%%%%%%%%%%%%%%% 实验结论   %%%%%%%%%%%%%%%%%%%%
%%%%设定不同的delta值，对选择最佳属性具有影响，进而影响测试数据的分类正确率
%%%%当delta=0.1时，采用信息熵增益最大挑选最佳属性，正确率是0.908094435075885
%%%%当delta=0.05时，采用用信息熵增益率最大挑选最佳属性，正确率是0.910623946037100
